void scan_sensors() {
  for ( int8_t i = 0; i < sizeof( pin_t ) / sizeof( *pin_t ); i++ ) {
    dht_scan(pin_t[i]);
    ds_scan(pin_t[i]);
  }
}

// ------------------ Преобразование MAC адреса в читаемый вид ------------------
String macToStr(const uint8_t* mac)
{
  String result;
  for (int i = 0; i < 6; ++i) {
    result += String(mac[i], 16);
    if (i < 5)
      result += ':';
  }
  return result;
}
// ------------------ Преобразование MAC адреса в читаемый вид ------------------
//-------------------------------------------------------------------------------------------------------------
// ------------------ Мигание диодом по передаваемым параметрам ------------------
void led_bip(int c, int d) {
  for (int i = 0; i < c; ++i) {
    ledON;  delay(d);   
    ledOFF; delay(d + 200); 
  }  
}
// ------------------ Мигание диодом по передаваемым параметрам ------------------

